RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/deprecated/inc/hw_can.h
//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF2ARB register
//
//*****************************************************************************
#define CAN_IF2ARB_ID_S           0
#define CAN_IF2ARB_ID_M           0x1FFFFFFF  // Message  Identifier
#define CAN_IF2ARB_DIR            0x20000000  // Message Direction
#define CAN_IF2ARB_XTD            0x40000000  // Extended Identifier
#define CAN_IF2ARB_MSGVAL         0x80000000  // Message Valid

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF2MCTL register
//
//*****************************************************************************
#define CAN_IF2MCTL_DLC_S         0
#define CAN_IF2MCTL_DLC_M         0xF         // Data length code
#define CAN_IF2MCTL_EOB           0x80        // End of Block
#define CAN_IF2MCTL_TXRQST        0x100       // Transmit Request
#define CAN_IF2MCTL_RMTEN         0x200       // Remote Enable
#define CAN_IF2MCTL_RXIE          0x400       // Receive Interrupt Enable
#define CAN_IF2MCTL_TXIE          0x800       // Transmit Interrupt Enable
#define CAN_IF2MCTL_UMASK         0x1000      // Use Acceptance Mask
#define CAN_IF2MCTL_INTPND        0x2000      // Interrupt Pending
#define CAN_IF2MCTL_MSGLST        0x4000      // Message Lost
#define CAN_IF2MCTL_NEWDAT        0x8000      // New Data

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF2DATA register
//
//*****************************************************************************
#define CAN_IF2DATA_DATA_0_S      0
#define CAN_IF2DATA_DATA_0_M      0xFF        // Data Byte 0
#define CAN_IF2DATA_DATA_1_S      8
#define CAN_IF2DATA_DATA_1_M      0xFF00      // Data Byte 1
#define CAN_IF2DATA_DATA_2_S      16
#define CAN_IF2DATA_DATA_2_M      0xFF0000    // Data Byte 2
#define CAN_IF2DATA_DATA_3_S      24
#define CAN_IF2DATA_DATA_3_M      0xFF000000  // Data Byte 3

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF2DATB register
//
//*****************************************************************************
#define CAN_IF2DATB_DATA_4_S      0
#define CAN_IF2DATB_DATA_4_M      0xFF        // Data Byte 4
#define CAN_IF2DATB_DATA_5_S      8
#define CAN_IF2DATB_DATA_5_M      0xFF00      // Data Byte 5
#define CAN_IF2DATB_DATA_6_S      16
#define CAN_IF2DATB_DATA_6_M      0xFF0000    // Data Byte 6
#define CAN_IF2DATB_DATA_7_S      24
#define CAN_IF2DATB_DATA_7_M      0xFF000000  // Data Byte 7

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3OBS register
//
//*****************************************************************************
#define CAN_IF3OBS_MASK           0x1         // Mask data read observation
#define CAN_IF3OBS_ARB            0x2         // Arbitration data read
                                              // observation
#define CAN_IF3OBS_CTRL           0x4         // Ctrl read observation
#define CAN_IF3OBS_DATA_A         0x8         // Data A read observation
#define CAN_IF3OBS_DATA_B         0x10        // Data B read observation
#define CAN_IF3OBS_IF3SM          0x100       // IF3 Status of Mask data read
                                              // access
#define CAN_IF3OBS_IF3SA          0x200       // IF3 Status of Arbitration data
                                              // read access
#define CAN_IF3OBS_IF3SC          0x400       // IF3 Status of Control bits read
                                              // access
#define CAN_IF3OBS_IF3SDA         0x800       // IF3 Status of Data A read
                                              // access
#define CAN_IF3OBS_IF3SDB         0x1000      // IF3 Status of Data B read
                                              // access
#define CAN_IF3OBS_IF3UPD         0x8000      // IF3 Update Data

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3MSK register
//
//*****************************************************************************
#define CAN_IF3MSK_MSK_S          0
#define CAN_IF3MSK_MSK_M          0x1FFFFFFF  // Mask
#define CAN_IF3MSK_MDIR           0x40000000  // Mask Message Direction
#define CAN_IF3MSK_MXTD           0x80000000  // Mask Extended Identifier

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3ARB register
//
//*****************************************************************************
#define CAN_IF3ARB_ID_S           0
#define CAN_IF3ARB_ID_M           0x1FFFFFFF  // Message  Identifier
#define CAN_IF3ARB_DIR            0x20000000  // Message Direction
#define CAN_IF3ARB_XTD            0x40000000  // Extended Identifier
#define CAN_IF3ARB_MSGVAL         0x80000000  // Message Valid

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3MCTL register
//
//*****************************************************************************
#define CAN_IF3MCTL_DLC_S         0
#define CAN_IF3MCTL_DLC_M         0xF         // Data length code
#define CAN_IF3MCTL_EOB           0x80        // End of Block
#define CAN_IF3MCTL_TXRQST        0x100       // Transmit Request
#define CAN_IF3MCTL_RMTEN         0x200       // Remote Enable
#define CAN_IF3MCTL_RXIE          0x400       // Receive Interrupt Enable
#define CAN_IF3MCTL_TXIE          0x800       // Transmit Interrupt Enable
#define CAN_IF3MCTL_UMASK         0x1000      // Use Acceptance Mask
#define CAN_IF3MCTL_INTPND        0x2000      // Interrupt Pending
#define CAN_IF3MCTL_MSGLST        0x4000      // Message Lost
#define CAN_IF3MCTL_NEWDAT        0x8000      // New Data

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3DATA register
//
//*****************************************************************************
#define CAN_IF3DATA_DATA_0_S      0
#define CAN_IF3DATA_DATA_0_M      0xFF        // Data Byte 0
#define CAN_IF3DATA_DATA_1_S      8
#define CAN_IF3DATA_DATA_1_M      0xFF00      // Data Byte 1
#define CAN_IF3DATA_DATA_2_S      16
#define CAN_IF3DATA_DATA_2_M      0xFF0000    // Data Byte 2
#define CAN_IF3DATA_DATA_3_S      24
#define CAN_IF3DATA_DATA_3_M      0xFF000000  // Data Byte 3

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3DATB register
//
//*****************************************************************************
#define CAN_IF3DATB_DATA_4_S      0
#define CAN_IF3DATB_DATA_4_M      0xFF        // Data Byte 4
#define CAN_IF3DATB_DATA_5_S      8
#define CAN_IF3DATB_DATA_5_M      0xFF00      // Data Byte 5
#define CAN_IF3DATB_DATA_6_S      16
#define CAN_IF3DATB_DATA_6_M      0xFF0000    // Data Byte 6
#define CAN_IF3DATB_DATA_7_S      24
#define CAN_IF3DATB_DATA_7_M      0xFF000000  // Data Byte 7

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3UPD register
//
//*****************************************************************************
#define CAN_IF3UPD_IF3UPDEN_S     0
#define CAN_IF3UPD_IF3UPDEN_M     0xFFFFFFFF  // IF3 Update Enabled
#endif
